Revit 2026 API

# ElementIsPhaseCreatedValid Method

---

Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsPhaseCreatedValid(
	ElementId createdPhaseId
)
```
```vb
Public Function IsPhaseCreatedValid (
	createdPhaseId As ElementId
) As Boolean
```
```cpp
public:
bool IsPhaseCreatedValid(
	ElementId^ createdPhaseId
)
```
```fsharp
member IsPhaseCreatedValid :
        createdPhaseId : ElementId -> bool
```

#### Parameters

createdPhaseId ElementId
     The id of a Phase.

#### Return Value

Boolean True if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Acts as a validator for setting the property CreatedPhaseId.

#### Reference

Element Class

Autodesk.Revit.DB Namespace